/*
**  $$=================================================================================$$
**  ||                                                                                 ||
**  ||               ------                                                            ||
**  ||            ------==+                                                            ||
**  ||         ------=+++++                     _____            _                     ||
**  ||      ------=+++++                       /  __ \          | |                    ||
**  ||    =----=++++=           ------         | /  \/ __ _ _ __| |__   ___  _ __      ||
**  ||    ***++++            ------=++         | |    / _` | '__| '_ \ / _ \| '_ \     ||
**  ||    ***+++          ------=+++++         | \__/\ (_| | |  | |_) | (_) | | | |    ||
**  ||    ***+++      ------==++++**++          \____/\__,_|_|  |_.__/ \___/|_| |_|    ||
**  ||    ***+++     ++--==+++++****++                                                 ||
**  ||    ***+++     ***+++++   ****++               The ultimate high-level           ||
**  ||    ***+++      #*++      ****++                  library for C/C++              ||
**  ||    ***+++                ****++                written in C11/C++14             ||
**  ||    **+----             :---=+++                                                 ||
**  ||    *****=-----      ------=++++            Licensed under AGPL-3.0-only         ||

#if defined(__GNUC__) || defined(__clang__)
#define CARBON_INLINE __attribute__((always_inline)) static inline
#define CARBON_NOINLINE __attribute__((noinline))
#elif defined(_WIN32) && defined(_MSC_VER)
#define CARBON_INLINE __forceinline
#define CARBON_NOINLINE __declspec(noinline)
#else
#define CARBON_INLINE static inline
#define CARBON_NOINLINE
#endif

#if !defined(__cplusplus) && (defined(__GNUC__) || defined(__clang__))
#define CARBON_STATIC_ASSERT _Static_assert
#else
#define CARBON_STATIC_ASSERT static_assert
#endif

#if !defined(CARBON_VERSION_MAJOR) || CARBON_MACRO_IS_EMPTY(CARBON_VERSION_MAJOR) || !defined(CARBON_VERSION_MINOR) || CARBON_MACRO_IS_EMPTY(CARBON_VERSION_MINOR) || !defined(CARBON_VERSION_PATCH) || CARBON_MACRO_IS_EMPTY(CARBON_VERSION_PATCH) || !defined(CARBON_VERSION_EXTRA)
#error Version information not valid
#elif CARBON_VERSION_PATCH != 0
#define CARBON_VERSION_RAW                                              \
  CARBON_EXPAND_AND_QUOTE(CARBON_VERSION_MAJOR)                         \
  "." CARBON_EXPAND_AND_QUOTE(CARBON_VERSION_MINOR)                     \
  "." CARBON_EXPAND_AND_QUOTE(CARBON_VERSION_PATCH) CARBON_VERSION_EXTRA
#elif CARBON_VERSION_PATCH == 0
#define CARBON_VERSION_RAW                                              \
  CARBON_EXPAND_AND_QUOTE(CARBON_VERSION_MAJOR)                         \
  "." CARBON_EXPAND_AND_QUOTE(CARBON_VERSION_MINOR) CARBON_VERSION_EXTRA
#endif

#if defined(__amd64__) || defined(_M_AMD64)
#define CARBON_CPU_ARCH "amd64"
#elif defined(__aarch64__)
#define CARBON_CPU_ARCH "aarch64"
#else
#error CPU architecture is not supported
#endif

#if defined(__linux__)
#define CARBON_TARGET_OS "linux"
#elif defined(__APPLE__)
#define CARBON_TARGET_OS "macos"
#elif defined(_WIN32) && defined(_MSC_VER)
#define CARBON_TARGET_OS "windows-msvc"
#elif defined(_WIN32) && defined(__MINGW64__)
#define CARBON_TARGET_OS "windows-mingw"
#else
#error Target OS is not supported
#endif

#if defined(__clang__)
#define CARBON_C_COMPILER "clang"
#define CARBON_CXX_COMPILER "clang++"
#define CARBON_COMPILER_VERSION __VERSION__
#elif defined(__GNUC__)
#define CARBON_C_COMPILER "gcc"
#define CARBON_CXX_COMPILER "g++"
#define CARBON_COMPILER_VERSION __VERSION__
#elif defined(_WIN32) && defined(_MSC_VER)
#define CARBON_C_COMPILER "cl.exe"
#define CARBON_CXX_COMPILER "cl.exe"
#define CARBON_COMPILER_VERSION _MSC_FULL_VER
#elif defined(_WIN32) && defined(__MINGW64__)
#define CARBON_C_COMPILER "x86_64-w64-mingw32-gcc"
#define CARBON_CXX_COMPILER "x86_64-w64-mingw32-g++"
#define CARBON_COMPILER_VERSION __VERSION__
#else
#warning Unrecognized compiler, using defaults.
#define CARBON_C_COMPILER "cc"
#define CARBON_CXX_COMPILER "c++"
#define CARBON_COMPILER_VERSION __VERSION__
#endif
#ifdef __cplusplus
#define CARBON_COMPILER CARBON_CXX_COMPILER
#else
#define CARBON_COMPILER CARBON_C_COMPILER
#endif

/*
**  $$===================$$
**  ||       Types       ||
**  $$===================$$
*/
typedef unsigned char u8;
typedef signed char i8;
CARBON_STATIC_ASSERT(sizeof(u8) == 1 && sizeof(i8) == 1, "Expected u8/i8 to be 1 byte");
typedef unsigned short u16;
typedef signed short i16;
CARBON_STATIC_ASSERT(sizeof(u16) == 2 && sizeof(i16) == 2, "Expected u16/i16 to be 2 bytes");
typedef unsigned int u32;
typedef signed int i32;
CARBON_STATIC_ASSERT(sizeof(u32) == 4 && sizeof(i32) == 4, "Expected u32/i32 to be 4 bytes");
typedef unsigned long long u64;
typedef signed long long i64;
CARBON_STATIC_ASSERT(sizeof(u64) == 8 && sizeof(i64) == 8, "Expected u64/i64 to be 8 bytes");
typedef float f32;
CARBON_STATIC_ASSERT(sizeof(f32) == 4, "Expected f32 to be 4 bytes");
typedef double f64;
CARBON_STATIC_ASSERT(sizeof(f64) == 8, "Expected f64 to be 8 bytes");

typedef u32 uint;
typedef size_t usz;
typedef ssize_t isz;
typedef uintptr_t uptr;

/*
**  $$=====================$$
**  ||       Version       ||
**  $$=====================$$
*/

/**
 * @brief Gets the library API version at runtime.
 * @param major The major component of the version (output argument pointer).
 * @param minor The minor component of the version (output argument pointer).
 * @param patch The patch component of the version (output argument pointer).
 * @return The full version string formatted as `vX.Y.Z[-EXTRA]`.
 */
CARBON_API char *carbon_version(usz *major, usz *minor, usz *patch);

/*
**  $$================================$$
**  ||       Testing Entrypoint       ||
**  $$================================$$
*/
#ifdef CARBON_TESTING_ENTRY
#define main(...)                                       \
  main(int argc, char **argv) {                         \
    carbon_test_manager_argparse(argc, argv);           \
